from src.CalcRating import CalcRating  # Импортируем класс CalcRating
from src.Types import DataType        # Импортируем тип DataType

def test_count_excellent_students():
    data: DataType = {
        "Акопян Арутюн Аркадьевич": [("математика", 90), ("литература", 95), ("программирование", 92)],
        "Иванов Джон Петрович": [("математика", 85), ("химия", 88), ("физика", 87)],
        "Сидоров Майкл Сидорович": [("математика", 90), ("литература", 90), ("программирование", 90)],
        "Александров Плутон Владимирович": [("математика", 75), ("литература", 60), ("программирование", 90)],
        "Быков Александр Петрович": [("математика", 61), ("литература", 61), ("программирование", 61)],
    }
    calc = CalcRating(data)
    # Ожидаемое количество отличников
    assert calc.count_excellent_students() == 2
